FSI/Tutorials/onewayFluid/Fluid/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    interface
    {
        type movingWallVelocity;
        value uniform (0 0 0);
    }
    inlet
    {
        type fixedValue;
        value $internalField;
    }
    outlet
    {
        type zeroGradient;
    }
    "(top|bottom)"
    {
        type            noSlip;
    }
    sides
    {
        type            noSlip;
    }
}


// ************************************************************************* //
